[
    {
        "title": "The Drift",
        "author": "NuclearBro",
        "content": "And so it begins. The drift. Honestly it caught me off gaurd. Did not think it was going to happen so soon. Maybe it's for the better. It's almost vacation. I know for a fact that it would have started then. But what the hell, what does it matter if it happend 2 weeks earlier. Usually it gradualy starts, but this time it was sudden. Oh well it's for the better. At least she feels better. At least she doesn't need me anymore. She is strong, smart and beuatiful. She will be fine. She will manage. My job is done I guess. I just hope things work out for her." 
    },
    {
        "title": "Fate",
        "author": "NuclearBro",
        "content": "Accepting your fate. People do it in many different ways. In the end we all have to make peace with the facts. What do I have to accept ? Well I tried my best, but I don't mean anything. I opened up, don't know why. She has her own problems. She doesn't need to hear about my troubles. Oh well the drift has begun, doesn't matter what I did. I know what comes next. I know all to well. She turns into a stranger with all my secrets. Don't make a mistake by thinking I am going to stop being there for her. I don't stop caring or helping. I just make sure not to hold them down with my problems. You had your chance, you blew it. This is your own fault. She deserves better. I only hope someone can give it to her, because clearly I can't."
    },
    {
        "title": "Opening Up",
        "author": "NuclearBro",
        "content": "Opening up. Not something I'm known for. Maybe because nobody cares. well my mom asked what's going on, apparently my brother asked her what is wrong with me. Wish I knew what was wrong. Wish I could have told her that I just needed someone to talk to. But I made a promise, there is one condition that keeps me from telling her when I don't feel like myself. She was busy enjoying her time with him, honestly I'm glad that things are looking up. So following the rules I set for my self I decided to leave her be. She hasn't spent much time with him lately so it's my responsibility to grant her some quality time with him. Anyway I need a place to vent so here I am. I don't know what is wrong. I can't eat, sleep or think. I find myself sinking back into a very deep hole. I know that I can't sink to deep or else I might not come back again. "
    },
    {
        "title": "Good Place",
        "author": "NuclearBro",
        "content": "Dam I was in such a good place. Sure there were a few downs, but most of the time I was extremly happy. Now I feel like I don't have someone to talk to. I thought moving on would be easier. Truth is it still hurts. I thought I made peace with the fact that I am going to go through life alone clearly I haven't. Sure I hide the pain, I hide the lonelyness. Truth is outside I'm smiling but inside I'm dying. Slowly sinking into the dark. Oh well as long as no one sees it everything will be fine. This is why I don't open up. It hurts and most people don't really care. Others pretend to care and then just leave."  
    },
    {
        "title": "Things",
        "author": "NuclearBro",
        "content":  "Heard some interesting things tonight. Since I can't sleep I might as well write this book. He has such a split personality. She asked me what to do, for the past week I thought everything was going great. So in my mind she was going to be ok. He stopped pushing her. He started being decent. Oh boy do I wish this was the case. She asked me what to do, I told her I had been wondering the same thing. Honestly the way I see it there are 2 choices. Stay and run the risk of him being a horny gorilla. Leave and run the risk of staying single. Neither of those are good. Pushing someone past their boundaries for your personal gain is as low as it gets. Being single ain't much better tho. Because there is nobody like him to go to if she leaves him. Sure I will be there to help, but a friend doesn't mean as much as a lover. All I can do is try to help, but that isn't the same as having someone in whose arms you can feel safe in." 
    },
    {
        "title": "Grand Finale",
        "author": "NuclearBro",
        "content": "Won't lie, I can't remeber what I wrote in the other books. And I don't even care anymore. I'm back to my normal self. No emotions, no feelings. This is just better for everyone. Only wish that I didn't show the people close to me how nice, loving and caring I am when I'm in love. Because now they think there is something wrong when I'm my normal self. Fuckit, it was fun while it lasted but finally I'm begining to wake up. Hurts, but I don't even care anymore. Thought about life last night. I came to the conclusion that if I don't find someone or something to live for before I'm 30. I might just take out life insurance and drive off a cliff or something. The money I will send to my hand full of people I care about. Also reviewed each person that I care about. Realized that some of them don't care about me. They never did, and never will. It was fun being a normal human with emotions and feelings for a while. Not going to lie I really enjoyed it. But I know the world is cruel and unforgiving so in order to save myself I remove my emotions and feelings. Sure I don't hide them when I'm with people I trust. Sure they sometimes hurt me, but at least I know there is a reason for them to hurt me. They actually care. And I'm sorry for them, they had to put up with me. I will make it up to them before I go. Been thinking about side jobs for the future and something that intrigued me was being a test pilot. Now I know the planes that the military test are very safe, so I moght have to go work for a private company. It will pay well, and I get to fly planes. Something I love, and there is risk involved. It just checks all the boxes. I actually am sorry to admit that it took me this long to accept the facts. I knew from the begining it was too good to be true. I had hope I guess. Bad to know how much that can hurt. The only reason I stopped loving is because....... I know she doesn't love me, and I made peace with that, I think..."
    },
    {
        "title": "Realization",
        "author": "NuclearBro",
        "content": "Oh boy don't I hate myself at the moment. It's all my fault. It is my fault and mine alone that I find myself in this situation. Why did I do it? Wanted to be secretive and what did I achieve? Nothing but push her away. It's too late to try and get her back. Not a milion words can bring her back. I know, because I tried. Neither can a milion tears bring her back. I know, because I cried. I owe her a massive apology. I have a idea that I think is pretty sweat. Unfortunately the timing is difficult. I will have to wait a while. What are the plans going forward? Try to help, not really much more that I can do. This is my own fault. I should have just opened up from the begining. But no I hade to try and play hard to get. Boy I'm stupid. Took her trust for granted, took her care for granted, took her for granted. Only now do I really realize how truely great she is. But like I said. I blew it. I thought about fading away. Why ? Maybe to avoid getting hurt. Now I realize that is so selfish. So I made a promise to myself. No matter the pain, I won't leave. Truth be told it's easier now that I made piece with what I am to her. Always thought that I would be the guy who makes her happy. Be the one to put the world on a plate for her. Oh well I blew my chances. She is searching for someone else. I pray to God she finds someone who is worthy of her love. She deserves only the best of the best, nothing less. And don't let me hear anything else. After everything she does for everyone around her she deserves to be treated like gold."
    },
    {
        "title": "16 Dec",
        "author": "NuclearBro",
        "content": "Been a while since I wrote one of these. Fact of the matter is that for the past few weeks everything has been a blur. The whole year actually. I only remeber little bits here and there. Just now a big chunk of the memories came back. It must have been her voice. The dissapointment in it must have been what brought back my memories. Why don't I remeber anything that happend this year. Well a few weeks ago I crashed my bike. And unlike the begining of the year this one was serious. I'm still repairing my bike. The scars have began to dissapear. The bruised ribs are also getting better. And like I Just said the memories are starting to come back. I havent told anyone about my accident, because I will most likely lose my bike if they find out. Back to the memory thing. I remember the ride, and the bike tipping over. The last thought through my mind was: is this it?"
    },
    {
        "title": "Anonymous",
        "author": "NuclearBro",
        "content": "There is nothing as painfull as being hurt by that someone who is suppose to protect you from every thing. That someone who's arms you feel safe in. They have the ability to make you feel like your in Heaven or the can rip your hart out. Beleiving that you deserve to be treated badly is so wrong.This girl I know believes it's what she deserves. She believes that in order for her to get through a day she has to get hurt. Worst still is that her person is hurting her like this. She is such a pretty specimen. She deserves to be treated like a princess. Because of a rough past she believes she deserves to get hurt. This is so not true. She deserves nothing but the best. She deserves to have the world layed at her feet. It's true that being hurt makes you stronger, but one can only be hurt so much. And she is already stronger than most. So she of all people doesn't deserve the pain. She has a heart of gold, no one can deny that. If only I could explain to that man how much he is hurting her I'm sure he will stop. It's clear he doesn't know what a gem he poses. And explaining to him he is destroying it will make him stop. For he cares deeply about her and will do anything to avoid hurting her."
    },
    {
        "title": "Attempt Happy",
        "author": "NuclearBro",
        "content": "Not being enough, what does it actually mean? Some might say it's not living up to other people's expectations. Others say it's not living up to one's own expectations. Personally I don't much care about other people's expectations, but it hurts seeing people I care about beat themself up because of others expectations. Some of the people beat themselfs up over their own expectations that the create because of what the people around them say and think.Don't get me wrong. self improvement is a good thing, but even to much of a good thing can be bad. One great example is this one girl I know. Stunning eyes, beautiful dark brown hair, a smile that can cure even the deepest pains. I never thought someone could be beautiful,stunning, lovely, striking, magnificent, enchanting, dazzling and breathtaking all at once. She will argue with what I just said, I only wish I could let her see herself through my eyes. Unfortunetly I can't do this, and because of something in the past she believes she is not worth being themain character in her story. And I wish I could show her that she has no reason to feel this way. She is better than perfect in every single way. I quite frankly don't know how the other guys keep their jaws from dropping to the floor at the sight of her pure beauty."
    },
    {
        "title": "Bad Idea",
        "author": "NuclearBro",
        "content": "Moving on, always easier said than done. Having to pick up all the feelings, regrets and memories just to try and move on. My method, rather than try and move on with all the emotions I try and detach myself bit by bit. This way you don't break down yourself entirely, but rather peace by    peace. Losing only bits of yourself along the journey of moving on is a lot easier to cope with than having your heart ripped out all at once. The only problem with my method is that when ever I get hurt I close down. I loose myself in sad music. Hide all my emotions and just put on a smile and say everything is ok. It might seem that everything is fine. I seem happy, I laugh alot. But the truth is that Deep down I know I'm hurting, and that fact I can only hide from myself for so long. O well as long as no one sees the pain everything will be alright. Unfortunetly for me I met this one person who sees through all my layers. I struggle to hide anything from this person. But the more I get to know this person the worse I feel knowing that they have to deal with all my problems, when they have their own problems far worse then mine. And although opening up feels good. I can't continue to use this person for my own gain. Maybe one day I will tell them all my secrets, all my little quirks, every small detail about me, but that is but only a dream."
    },
    {
        "title": "Blank",
        "author": "NuclearBro",
        "content": "So you had a bad day. I truely wished that you never had to see this book. It will come as no surprise that I have no idea what might have happend. So I will do my best to address some of the main things that could go wrong. If you don't feel the best about your looks, just remeber that from everyone he chose you. The guy who could get any girl that he wants chose you. This is because of two main reasons. Don't make a mistake there are many more, but these one's stand out. Firstly it's your stunning personality. Secondly it's your unparraleled beauty. No one can come close to you. I wish you could see yourself through our eyes, because clearly your mirror lies to you. There is no one on this green earth that comes close to your heavenly beauty, don't let anyone dare tell you otherwise. If you feel down because you feel like you ate too much, firstly you don't eat to much. In fact you don't eat enough. You compare yourself to us. Don't there's a reason woman live longer than men. We eat way to little. This is a clasic demonstration of judging a fish by it's ability to climb a tree. Youre way to hard on yourself. And it concerns me. Please don't compare yourself to us. We stupid. Like really really stupid. And I know for a fact you ain't stupid. So please don't starve yourself just because we do it. It isn't good for you. If he hurts you, first things first. I'm sorry, really I am. You don't deserve it."
    },
    {
        "title": "Fax",
        "author": "NuclearBro",
        "content": "Feeling dead inside. Tried it for most of my life. Was working well up until the end of last year. Met a girl, made a mistake, got hurt. From then on I have become a lot more suciptable to emotions. Tried hiding it again. Failed miserably again. Met someone who I can care for and try to help. She has a sweet smile, loving energy and she is one of the most fun people I know. There is never a dull moment with her. I truely can't remeber the last time feeling this happy. I tried to hide things from her, but I'm past that. I trust her to know my deepest secrets. Truth be told the thought of suicide has been on my mind a lot lately. Don't ask me why. It would just pop up, make me feel sad and depressed, and than as quick as it appeared it would be gone. One of the things I do to help me over come the bad urges is to sit back and think back to some of my favourite memories. Can't remember the last time that she wasn't in of my memories. Sure I could get hurt opening up, but you know what. I don't care if it hurts she is so much more important to me than just feeling bad for a bit. Sure I listen to sad music, but thereason for it is that after the pain caused by the song there are only good memories. Basically one could say I'm addicted to being hurt, truth is I'm addicted to what comes after the pain. As some might say, I find the end of the rainbow each time that happends. Dam, don't I wish I could express to her how I truely feel. All in good time I guess. Maybe, just maybe I write a book explaining how I truely feel. Truth is now might not be the best time, then again when will it be the best time. Thinking about it, as long as she is happy. I will be as well. She truely means the world to me"
    },
    {
        "title": "Happy Memories",
        "author": "NuclearBro",
        "content": "Memories. Be it happy or sad they are part of us. Personally I have alot of both. Although recently I have been dwelling in the bad memories. Why I did that I don't know. Well I guess I kinda know. Now however I have been focussing on the good ones. Don't know what triggered it. Might have been last nights dream. Now I very rarely dream. Last night's was one of the first one that wasn't a nightmare that woke me, or one I forget in the morning. It was warm and fuzzy, like a happy cloud. It brought me back to some of my favourite memories. Unfortunetly if I had the choice I would have skipped some of those memories. But there aint no point in trying to fix the past. Never thought she would come to mean so much to me. In hindsight I probably should have just never given her the attention she wanted. She did leave me for another guy. Never the less I'm trying to remember the good. All the stupid jokes. The movie experience. Her first sushi attempt. My poor stolen hat. I remeber it like it was yesterday. The stinking smell of the Mooi Rivier Mall sent chills down all of my bones, or maybe it was the stress. She came walking from the complete oposite direction I suspected. Boy did I not feel like an idiot. Never the less John Dorrys was nice and warm. The ocean smells tickled my nose. Sitting oposite her I make it look like I know what I was doing. Nearly hitting the waiter in the face with the menu as I attempt to schetch my story to her. Can't even remeber what it was. Just her sudden burst of histaricle laughter as the poor waitress flee the scene where she was nearly beaten. The sushi danced on my tongue as I sat with a smile, just staring at her. She was busy un-sticking the sushi from the plate. After that we went through the mall. To this day I had no idea what gave me the idea to walk into PNA. Not that that was a bad thing, they have beuatiful gift bags and cards. Hand in hand we strolled down the mall. Laughing at the stupid things we saw. Finally the movie. I think it was justice leauge. I have no idea. Holding her in my arms felt like something straight out of a book or movie. The next day I headed over to her house. Of course I bought her mom some beautiful multi-coloured rosses with a chocolate. I gave her a extremly cute teddy bear.  If it wasn't for her I would have kept it for myself. I thought Flash was fast, but time ran cirles around him that day. Having her in my arms felt.... I don't quite have the word for it, magnificent is probably the closest. It was only after she left that I realized she stole my favourite hat and my favourite jacket. Nothing I can do about it now. It was almost her birthday, I could barely keep my excitement at bay. I bought her a nice set of chopsticks to remind her of our first date. A snow globe with a couple hugging in the snow to remind her of our extreme movie night adventure. It was – 20 degrees outside, well at least it felt like that. We were wrapped up in warm blankets watching a scary movie, nothing quite like that. Followed by some of her favourite chocolates. Lastly a neckless with her favourite animal. A small blue crystal in the dolphin’s eye. Our initials etched into the metal, surrounded by a heart. Little did I know what would happen that weekend. Her dad came to visit her. Me and him got along extremely well. Little did any of us know what would happen that Sunday night. Actually, that’s a lie. I knew something bad was going to happen. Being in love. There is nothing quite like that. Having that one person whose arms feel like home. Their caring eyes to assure you that everything will be alright. Your person who knows all of your dirty little secretes and deepest insecurities. That one person who stops the world from spinning as you gaze into their eyes. Taking you to another dimension as you softly kiss them. All of your problems just magically melt away. The first thing I do when I fall in love is, I unknowingly stare at that person in awe. This I only recently found out. Is there someone special who makes me do this? Maybe, maybe not."
    },
    {
        "title": "Leave",
        "author": "NuclearBro",
        "content": "[[[[[[[[[[[[[[[[[[[[[[[[(Redacted)]]]]]]]]]]]]]]]]]]]]]]]] All of these I would love to tell her, but I know that is only going to cause more hurt. I already know the facts. That's why I never dare to say any of these to her.When I hear her cry I wish I could just give her a hug, roll her up in a blanket, like a sushi roll. Place her on a comfortable place. Gather her favourite snacks. Put on her favourite movie. Just sit beside this cute little sushi roll. Feeding her snacks and making sure she is ok. It'sactually with tears in my eyes and a heavy heart that I admit this is never going to happen. Why would it? I got to invested and now it hurts to try and move on. Recently wrote a book about going out with Maryke. As nice as she is, she is not the same. I know It's fucked saying that. Maybe it's better to just end it all. Why even bother trying. I know it's never going to happen. I tried, I know that I mean nothing to her. Be that as it may, I will still fight with every ounce of my being to make her happy. Guess I am just a huge fucking simp. How pathetic. You don't deserve to be alive. Just go. Everyone will be better of without you. Book those plane tickets and just leave. No one is going to miss you. You already messed up their lives, it's time to leave. You have that list of possible jobs in America. Just go. You were so close to leaving. Put in your earphones, turn off your data, drive to the airport. It's as simple as that. Leave all the emotions behind. Come back some time, see that Dian got the girl he liked. Simone' worked everything out. Arno almost done with uni. Niel still as naughty as always. Dad will be in a happy place. Mom might have even achieved the impossible and maried again. Uncle will be done with the satisfactory world. Then just as sudden as you appeard you have to dissapear again. Just to make sure you don't ruin anything."
    },
    {
        "title": "Memories",
        "author": "NuclearBro",
        "content": "Why do I keep comming back to this place? This place has so many memories. I know jurnaling is the only way to realy open up. There is no need to bother someone with my thoughts if I can just write them down. Always had a stupid exuse as to why I don't jurnal in a word doc. Reality is that when i write a book there is a small chance that sameone will read it. Using a word doc means no one would ever look at it. The reason for always coming back here when i write is that i have so many happy memories here. Truth is that those happy memories can also be the saddest memories. For me to write about myself i have to be sad, so it only logically makes sense to come to the place where you can be at your happiest or your worst. I know how repetitive it is to constantly write about the same topic. Unfortunatly i don't want to write about topics that i have no info about. That's why i write about my feelings, sure it opens up wounds, but what is life without a little pain. Pain reminds us of the journey that we have traveled to get to where we are today. Sure it also reminds you of all the mistakes you have made. But nothing ventured, nothing gained. Didn't think i would ever continue to write this book. Seeing as i'm here now i might as well just finish it. In order not to write something that i have written before i have decided to do a tour of this world and talk about some of the special builds and the reasons behind them. First item on the docket was my poorly executed graveyard. i built it to display my broken heart. Fuck that sounds cliche. Anyway, a graveyard surrounded by lava and fire, not only was it meant to add atmosphere to the build it was to show the scars and bruises left behind from previous relationships. The feelings being burried needs no explanation. I was in love with someone so above my leuge you wouldn't even believe. But hey that's all in the past now. Then there is my boat in a bottle. It pays tribute to Livingston's song called message in a bottle. i built it with this song in mind, because in the song Livingston says that he writes a message in a bottle that he hopes his lover never finds, because it holds all his love for her. Later on i had the boat errupt into fire to show my love burning away. In it's place i made a new boat, where the boat first was full of hapiness the second was filled with regrets and realisation that dreams rarely come true. The bottle contained books expressing my feelings, something i don't normally do. That is why i went with the bottle, i hoped no one would ever find it. Next on the list is my terrible pink floating words. Wrote them for someone i deeply care about. The reason i didn't simply write them in a book was because i felt she deserves more than just a few scribbles in a book. In essens it was in a attempt to place emphasise on the statement. Wanted to give it a cool shadow effect with stained glass, but time was not on my side, and i admit it was a bit of a rush job. Never the less i mean every last word of it. The last significant built was my enchanted golden apple. i constructed it after i got a a similar message on a regular enchanted golden apple. Instead of just giving back a normal sized apple i wanted to show that whatever she gave me, ten times more is what i would give back, because she truely deserves it. She is one of the few people in this world who desevers so much more. In hindsight there are some things i would have changed, but it's too late now. Those were simpler times, is all that's going through my mind at the moment. Truth be told those were also some confusing times. Trying to figure out where i stood with this special someone left me with alot to think about. In the begining nothing mattered to me. I didn't give a dam about my classes, all i knew was that i fell hard for someone and no matter what i did i just couldn't shake her from my mind, not that i wanted to get her off my mind. She was a light at the end of a very long and dark tunnel that i had been in. As time progressed i started to gain more control over my thoughts, forcing myself to start focusing on facts rather than dreams. I was at war with myself. My heart wanted to go this way, but my head knew of better. It was a tug of war and didn't know which side i wanted to win. Having my heart win meant that i might get it broken again. -It's kinda funny, even if i get my heart broken i continue to love the person that broke it with all the little pieces.-On the other hand if my mind won i might miss the opportunity of a life time. And there would be no forgiving myself for that. In the end i guess my mind won. i had forced my feelings deep down as a defense mechanism. Even tho all is said and done i still catch myself thinking of her, just hoping she's happy. And i still can't stop myself from shivering or getting goosebumps everytime i get to hear her breathtaking voice. My mind turns into a racetrack, all my thoughts speeding around. My heart turns into a jackhammer. Beating out of control. i have never felt this way about someone before. Like i said in the begining this is my message in a bottle. i don't often tell people about the things i have written in the books, but little by little i found myself opening up to someone, someone who means the absolute world to me. Thank you for being my world."
    },
    {
        "title": "Message in a Bottle",
        "author": "NuclearBro",
        "content": "Keep fighting. You don't stand a single chance to win unless you fight. Eren Jaeger, Attack on titan. Every day every single one of us is fighting, be it to get a promotion or just to make it through the day. Why do we keep on doing it? Is it simply because we don't know? What else to do? Get knocked down you have to get up, but how many times can one get back up. I guess it depends on the importance of the fight. If it's important enough, you most likely will get back up every time. But how do you determine if the thing you’re fighting for is even worth it? I suppose that's what experience is for. Unfortunately, this doesn't always work out. If you get knocked down too much before you find something or someone worth fighting for you will give up. You will stop fighting to spare yourself some pain, regret, and disappointment. You lose yourself and having to find yourself after being lost for too long can prove to be impossible. It's like losing yourself to the void. An empty abyss. Some people find something or someone to cling to get out of such a dark bottomless pit. I don't know if that's better or worse. On one end you can try to find yourself. On the other, the fight cycle starts again.Hope, is one of the biggest deceivers. Having hope is great in some cases, but more often than not it hurts and disappoints people. I would know. Some people had hope for me, how disappointed they were. Why did they have hope for me?Surely, they must have seen I'm a lost cause. My only goal on this earth is to help other people. I don't give a damn about my problems. Sure, being beaten up, verbally abused, insulted, humiliated, manipulated, and just made the bad guy in every story hurts. I just choose to ignore the pain. I try to ensure that no one other being has to go through so much pain. I'm not saying I'm unique, or better than anyone. There are many stories far worse than my own. I’m trying to say that I know how most things feel. That’s why I try and help. No matter how many bad memories it brings up.  Fuck, saying that makes me sound like a good person. That's not true. The things I did. I honestly should have just rolled over and died. I remember every time I got beaten up the guy would ask You give up yet shitface? My answers were always the same. Never asshole Sure I got beaten even more, but it was worth it. Thinking about it I'm glad I went through all the events that I went through. It keeps me grounded. Of course, nobody knows this, and I don't think anybody will ever know. I just keep this to myself. It's my burden to bear. Maybe one day I will tell someone. The problem is that the times that I have opened up to people they turn into strangers with some of my secrets. That is entirely my fault. I forget that I'm only here to help other people. Or at least to try. It was all going well, until recently. I was only supposed to help her and try to fix her problems, but before I knew it she knew most of mine. She made it her job to try and fix my problems, even though she has her own to fix. Even worse is that she has her own special persons problems to try and fix. Now I’m just taking up her time and energy with my stupid problems. That ain’t right of me. I’ve never found myself in a situation quite like this one. So I have no idea what to do. I concluded that comforting her that everything will be ok is the best path forward. Never speak a word of doubt about her person. Just always put him in a positive light. No matter the personal cost. Though this choice has side effects too. If he does something to make her overstep her boundaries I have two options. Both starting with being a shoulder for her to cry on. Then I can either assure her that it won’t happen again, or I tell her the ugly truth to spare her from another similar experience. I told Zellie the bare minimum to just get her opinion about the situation. She thinks that I have to tell her the ugly truth right now, in order to try and spare her. But then again Zellie doesn’t have all the facts. It isn’t my place to say anything so I won’t ever tell anyone everything. She also told me she misses the good old days. Me and her. She reminded me of everything. Us going to the movies and feeling as awkward as can be. All of our little adventures. Picnic under the stars, blankets wrapped tightly around us to keep out the cold. The gigantic red bear with the words “I love you” written on a heart which was locked in its paws. Going for walks and just talking about the most idiotic things. We had no secrets. It was the agreement we made the day I asked her out. I could lay myself bare to her. She knew everything about me, all my inner workings, just as I knew hers. Having her by my side I felt like I could do anything. No mountain too big to climb. No ocean too rough to tip my little boat. Every time I think of her the same memory comes back. Standing on top of the wagon filled with corn I glanced at her. Her face was a ray of sunshine. Her golden blond hair danced in the light breeze. A smile that could melt any cold heart. I remember thinking “how on earth did I manage to get the most beautiful girl in the entire school?” When she moved away I was a mess. I’ve never been quite able to open up to someone since then. Maybe because I think that I have to be in a relationship to have the ability to open up. Now I find myself between a rock and a hard place. As much as I want to open up to this amazing girl I hurt her when I do. If I don’t open up I also hurt her. And I’m so sorry about that. I hate hurting people. I would rather hurt myself than the people I care about. I never wanted it to be like this. But in the end, it’s my fault, and mine alone. I knew I ran the risk of falling in love, but my desire to help her and care for her got the better of me. Now because of my idiocy, she is in a difficult situation. And I hate myself for that. I want to help her, but I can’t. She wants help from her special person. And that ain’t me. As much as it hurts to admit it’s the reality. And I need to start facing it. I had the opportunity to be happy, I blew it. Now I’m ruining someone else’s opportunity to be happy. I should be happy for her. Her special person is superior to me in every single way. He has the looks and the skills and he walks the walk. I’m but merely a simple man with simple needs. I should have just never had hope for myself. Hope is a dangerous weapon. I guess I thought that because I did the impossible once I could do it again. Little did I know the games changed. So, as I said I am but merely a friend. Someone who listens and tries to help. I should be thankful that I’m even able to be a small part of her life. She said she is torn in half. Can’t lie I find that hard to believe. Like I said he is superior to me in every way. Other than that I’ve done nothing to deserve her care. I’ve broken all my promises to her. Now my goal is to just be the fat funny friend."
    },
    {
        "title": "Perfection",
        "author": "NuclearBro",
        "content": "Since I can't peel out my eyes and lend them to the one person who needs them to see their true beauty. I will put it in words. Not that words can come close to describe all her complexities. Dark brown hair, like a forest floor that comforts you. Deep brown eyes that anyone can get lost in Then there is the smile, the infamous smile that can melt worlds and fix any problem. But don't let it fool you she can stand her ground and defend her own. From the neck down everything is just as perfect as her breathtaking face. As stated before, don't let her looks fool you.She is more than capable of putting anybody in their place. She has a fierce fighting spirit, but also a soft and gentle heart. She's smart as whip too. If you ever get on her bad side, my advice will be to run. Not that that would help. She's relentless and quiting isn't a word in her disctionary. Trying to fight won't help either as she is battle hardend and always ready for a fight. If she stands with you you will be unstopable, but if she stands against you be prepared for all hell to break loose."
    },
    {
        "title": "Sad Reality",
        "author": "NuclearBro",
        "content": "I remeber it as if it was yesterday. Sunday May 8th was a cold and rainy winter night. I was driving with a milion thoughts racing through my mind. The conversation with my mother was still fresh in my mind. Her words, like footsteps in the sand, now embedded in my mind. Does she really think I'm going to get hurt again. She was right the first time. Just the thought about my ex nearly made my entire body shut down. The pain was unlike most things I've felt before. Pain is not something that I despise, I'ts part of me. That perhaps is my biggest flaw. When I care about someone I give them 200% of myself. This works out great until you wake up one day and realise you will do everything for that person, but they won't even do the littles thing for you. Everytime this happends 200% of my soul gets ripped from my body and that pain is something I can't bear. That's why I build walls and never open up to anyone. But this one person came into my life. The only person ever who was able to knock down some of the walls. She is really one of a kind.The problem that I face is having opened up to her I am vulnerable to that imence pain. This I only realized late that night. My mothers words flashed through my head again If you're always there for her, she won't realise what you mean to her. That can't be true,  could it? Just thinking about sacrificing any time that I get to spend with her makes me sick to my stomach. Because I know this won't last forever. And I want to cherise every moment I spend with her. I know who I am, and thats a fact that I made peace with long ago. She thinks I like the cold feeling inside, but thats not true. I love being warm and fuzzy, it's just that I don't get that feeling so I made myself use to the cold lonely feeling. I think it might be because I'm afraid of getting hurt again. Picking myself up again and moving on is something I'm dead something I'm dead afraid of.  So my coping mechanism is to just force myself to lose all the feelings. Sure that turns me into a shell of a human, but as long as I know the other person is ok I have to be ok. Depressing I know, but what can I do but try and move on.Like I said before pain is part of me, a rather hard thing to fix. Asof the time of writing this I have'nt stoped shaking once. The tears are flowing, just like last night. Only difference is that I did'nt notice them last night as the rain slammed into my face. Now unfortunetly they're unavoidable. I guess what I'm trying to say is that the future terrifies me. I want her to be happy, but I know I can't do that. I'm incapable of giving her what she needs and wants. Thats the story of my live. Find someone, try to help them, fall in love, see them loving someone else, try to move on. Depressing I know, but what can I do but try and move on. You're doing most of the work while not having the luxury of being in the relationship"
    },
    {
        "title": "This Is The End",
        "author": "NuclearBro",
        "content": "Thought this would be a book about things getting better, road to recovery. Thinking about it now, it isn't. This one is going to hurt. I know there is going to be a piece of my heart in this book. I have been putting it of, because I had hope. Finally I realized that it means nothing. Normally I ain't an emotional person, but I'm fighting to hold back the tears. There it goes. One single tear. Sliding gently over my cheek. Blurry vision, heart feels as if it's going to fall out of my chest. Dam I feel alone at the thought of what I'm about to say. Has been quite a while since I hurted this bad. But hey, nobody fucking cares. Not that I want anybody to care. Anyway, the point I wanted to make was that it doesn't hurt anymore. Hearing about him has no more effect on me. There is no more pain, not when I hear about how great he is. Not when she leaves for him. Never said anything, and I never will. It's so selfish of me to try and keep her for myself. I should throw myself of a bridge. What I did was/is so wrong in so many ways. Time for my brain to take the reins. My heart had a good run, but it's over now. The fun is over. Said in another book that it's time to face the facts. Never did face them, why? I'll tell you why. I had hope. What a dangerous dagger that is indeed. Been working myself to death just to keep my mind away from the good memories. Remebering those gives me hope. And every time I realize the memories were just to make me feel better, it kills me. Why did I ever have hope. Man I'm so stupid. I knew I was going to get hurt. Time to follow Zellie's advice. Support her, just as a friend. Why did I ever even think that it could have been more than that. Wow, it hurts admiting it. She had a really interesting dream, people with lights in the place of a heart. I really loved that idea. Hearing how she got hurt in the dream hurts me so much, I don't want her to get hurt. Ironic isn't it? Said I don't like seeing her get hurt then I do the exact same. Back to the point. She said I would be a green light. Maybe I would, but my little light would fade away. I would be sent to go be with the rejects. We would all just be looking in awe to everyone else. Everyone with their little lights going their own seperate ways. All while we wish we could only be like the others. And suddenly it feels like reality. I just look at everyone with their little lights. Every time I see someone who's light is fading I try and help. Knowing it may end up costing the destruction of my own little light. I have had my light broken. Usually I just pick up the pieces, and the try to help someone with my second hand heart. Some times some people come along that actually care about me, but mostly as soon as you fix someone you dissapear from their lives, until their light starts fading again. Oh well, like she said some people are meant to go through life alone. Only now does that actually sink in. Dam, don't I wish that I was worthy of being with someone. I am willing to sacrafice almost anything just to have someone. When I find someone I put my life on hold for them. They litterally mean the world to me. I do everything to ensure they are happy and ok. At the end of the day I was just jumping through hoops for someone who never cared. Someone who never thought of me as more than just a silly little pet. Maybe the best thing to do is just to stop trying to find someone. I would spare myself the pain. Then again I miss out on the good part. Anyway, I now know for sure that I'm barking up the wrong tree. NF was correct. If you want love you're gonna have to go through the pain. Well no need to try to get her to like me. I'm giving up. I have accepted the facts. Had the idea of creating a real life scavanger hunt for her. It would be around the entire town. All of it would have been minecraft themed. Golden apples with messages, papers with clues and maps with locations of the next item. I would have hired someone to drive her around. Personally I thought it was a great idea. The day would have ended with her having alot of tiny gifts, little notes and jokes, and of course there would be a big present waiting at the end. Oh well, was but wishfull thinking. I will pass the idea on to Charl. He can get the credit for it, and make her happy. As well as getting her to fall more in love with him. Win win situation. "
    },
    {
        "title": "Thoughts",
        "author": "NuclearBro",
        "content": "No reason for writing this book. Guess it's just to get rid of the thoughts. Don't really have another way of dealing with them lately. Thought that after I forgot all the good times the pain would stop. Problem is I can't seem to get those memories out of my head. Everyday is the same. Wake up, work through the day, get home, exercise, shower and the go to bed. That's when the trouble start. The memories come rushing back. And I wish I could just remove them from my mind. Not because I don't want to remeber them, but the pain they bring with is something else. Thoughts racing around in my head, what could have been, what has been and what will be. Apart from trying to fall asleep I also have to deal with constantly waking up in a cold sweat with my heart beating out of my chest. Nightmares, at least that's what I think. Best way to deal with them is to get up, put my head under the tap and just let the water wash away all of the horror. Apart from the sleeping issue I've managed to move on. To suppres the emotions. To hide the truth, not just to others but to myself as well. That was until today. Got sent an instagram post by one of my friends. And like a flood gate opening up the memories came rushing back. The mix of emotions and memories messed with my head. For a brief periode I found myself in the clouds again. Not having but 1 care in the world. Waking up to reality sucked. Wish I could go for a ride tonight, but I know that the chances of me returning are slim. Don't really know what I have to live for, but I know somewhere someone would need me. So second best thing is to put my headphones on and play music until my ears start to bleed. I'm not expecting anyone to read this, It's nothing special. Just some of my thoughts. Heard a quote the other day that got to me. It said that you don't show emotion, because you want to be seen as strong, but at the same time you hate that no one notices how broken you are. That quote however raises the question. How broken do you have to be before you allow someone to see the true you. For me atleast, I have to be at bedrock. I have to be broken down to the bone. And for me to even consider letting someone in I have to trust them. Trust them with my life. Still look what that has gotten me. The voices in my head are constantly at war. Screaming at each other. All of them wanting to come out. But my lips are sealed. I don't let them demons out, there's no need. I cause enough damage with them locked up. Heaven only knows what would happen if one day I fail to keep them inside. That is the day that I truely destroy myself and the people around me. I'm guessing the only thing these days that keep them under lock and key is my fear for the damage that I might cause to others around me. Even though things are on the ropes for me I'm at least happy to hear that things are going well for some of the people I care about. Like my uncle always say, no news is good news. There was a time when I just wanted to be around people to ensure they are ok. Now that I'm thinking about it I realise people only seem to want me around when things are not going well. Why? Because I listen, I don't judge, I don't care what time they need me. In essence I'm like a 911 operator. I work 24/7 I am willing to do almost anything to help. People are always shocked when they find out how many people I know that specialize in different professions. Reason being that in case someone should need something that might be hard for them to get, I could get with ease. Again the question, why? I'll tell you why. It's so that I can feel like I mean something. I feel like I'm helping. In reality though I did nothing. But as long as it keeps my demons at bay I will continue to believe that I'm helping. Spoke to one of my friends the other day, got to the topic of drinking. He asked me why I don't get drunk. Seeing as being drunk helps with pain and forgetting things. My answer was the same as it has always been. That was until I layed in my bed that night and thought about it. I don't fear the headaches the next morning, I fear that my dumb ass would carry out one of my stupid/ wreckless plans. Fortunetly for me I don't have to drink to feel drunk. Because of my fucked sleeping schedule and my stupid brain not properly sleeping I can barely keep my balance. Just sitting here in bed is proving to be a challenge. My head would just feel as if it's falling to one side and my body just follows it. Like a hobo chasing his runaway trolley. Yay jokes, that's how I dealing with things that trouble me. Turn them into jokes. Makes the people around you laugh which forces you to laugh with, removing the negative from the entire situation. What people don't know is that behind closed doors all of these problems still persists. And some days the just get to much, and then there is no stopping that tear from rolling over yor cheek. Without warning your heart turns to lead. You feel it hit the bottom. Your stomach cruples in a symphony orchestrated by a sore heart. The butterflies that once where just turn into stone. Your face becomes a runway for all the departing tears. Your whole body shaking as if there is a earthquake. There is no stopping it. Your mind races through all the memories and thoughts. The more you think the harder it gets to pull yourself together. The harder it gets to mend your broken world. Eventually the storm passes. You start to pick up the pieces and try to put the pieces back together again. But like a puzzel spilled onto the floor you don't always find all the pieces. Sometimes you loose a little of yourself. Either way you know you can't let anybody see it. That is until you found that one person. That one person that makes the earth stop spinning. That person who's eyes you get lost in. That someone who's smile is enough to pull you through the darkest of times. The one you would walk to the end of the earth for. They are the one with whom you can be open. The one you can tell about all your fears. The one in who's arms you feel safe. The one whose mear presence makes it feel as if your in the clouds. When your with them your untouchable. Not even the devil can scare you when they are by your side. But one of the most fucked up things is when that person that filled the empty void inside of you just fades away. That can break anyone. No matter what you've been through that is one of the most painfull experiences to ever exist."
    },
    {
        "title": "Ugly Truth",
        "author": "NuclearBro",
        "content": "As I am unable to say this I will put it on text. The only two reasons I don't tell you whats wrong is because I don't want to take any time that you spend with him away. The second being that it could hurt you. So now I am busy losing your trust, faith and most importantly you all because I can't bare the thought of hurting you. It might seem that breaking my promises come easy. I wish that was the fact. Every time I break a promise my heart skips a beat. I've never felt as bad in my entire life as I do after breaking a promise. In the end it's worth it tho. So if I loose myself and everyone that I hold near and dear to my broken heart just so that I have to avoid hurting them, I will. This is a sacrifice that no one else should have to make. So in order to try and spare others I lay myself bare to the emotional and physical pain caused bybreaking my promises. Not sleeping, throwing up all night, unstoppable shivers and the empty feeling are all common symptoms I experience when I break a promise. But in the end it has to be done. Not for my own good but the people that actually matter to me."
    },
    {
        "title": "Vaca",
        "author": "NuclearBro",
        "content": "I don't fully know what is bothering, nor do I know how to help. My working theory is that she is hurt by the fact that he doesn't want to send her <3 anymore. Don't know why he is this way, esepecialy now. He s less than a week from seeing her, meeting her in person. Boy there is nothing  nearly as amazing as getting to meet her. Him coming to visit might also be something that stresses her out. In my opinion there is nothing to worry about. He won't try anything. Then again apparently I never knew him. Is a funny story. He says that I overshare. Funny enough I clearly remeber him telling me that he doesn't know why people tell him their secrets, because he doesn't intend to keep them a secret. Oh well, back to the point. Maybe he just stopped sending her <3 because he had a bad week. Shit reason to stop sending the person you love <3, but I don't know what the situation is like. I'm sure he still loves just as much as the day he first got to know her. I mean what's there not to love. She has a blessing smile, she's quick on her feet, she's so caring and loving, she's extremely observing. And lets not forget her excuisite beauty. From head to toe she is nothing but a 10. Silky smooth dark hair. Deep brown eyes. Her nails might be intimidating at first, but they just add to her breathtaking beauty. Heaven only knows how this stunning girl has not won a award for her beautiful looks. She asked me why she did to deserve such a harsh life. Been chewing on that bone for a while, still can't figure it out. My best guess is that life tends to push people to their breaking points. And only the strongest survive. She is one of those extremly tough people Personally I would have cracked under the extreme preasure she is under. Thankfully it's vaca now, and I believe things will start looking up. He will treat her with the respect she deserves. She will feel safe in his arms. As she likes to describe it, it will feel like home. His gentle kisses will remind her of how much he truely loves her. Reasuring her of her true beauty, both inside and outside."
    },
    {
        "title": "Why Not",
        "author": "NuclearBro",
        "content": "I may regret this, I may hate myself for this, but that's nothing new. It's going to hurt, but so does not moving on. Waking up every morning with your heart bearly beating just isn't for me. Thought about going with Maryke to do something. Not that I really know what to go and do.  It's nice that she and I share som similarities like both of us being acquainted with the farm life. Boring as it may be we both know how it works and the ammount of work that goes into it. Then again other that that we don't have to much in common. If i didn't misread the situation I think that she likes me. Then again I don't know if I like her in the same way. She is an good friend and it was nice getting to know her better in matric. Who knows maybe things work out. Just don't want to get hurt." 
    },
    {
        "title": "Worst Idea Yet",
        "author": "NuclearBro",
        "content": "Opening up. The idea itself freightens me to my core. I've always been the therapist, never having to open up to anybody. This was due to the fact that I always act fine. Never let anyone know how I truely feel inside. Don't get me wrong I love to help other people, and I don't think I will stop.Now that I think about it I've opened up way past the point that I wanted to. And that fact scares me. There is one topic that terrifies me more than anything else. Trying to avoid it doesn't work. This is something that I have to get off my chest. I'm trying to get myself to move on, to bury the feels. For the most part I feel that I'm doing an ok job. Actually I think I might have finally accepted it. Yes it still hurts to hear how perfect he is, but I can't say that because that will make her stop talking about him to spare me. That doesn't sit right by me. How can I try and help someone if I don't have all the info. Puting myself before him like this is not something I'm willing to do. He is her everything, and as long as she is happy I am happy. My only goal in life is to make sure everyone's happy, myself excluded. Then there is my loving side. Of that I haven't showed her much. The only reason for that is that I can't show that side. If I show that side of me I won't be able to hide my true feelings. Why I punnish myself by thinking that I had a chance to make her happy I don't know. I have all the facts, I have every bit of effidence to convince myself other wise. Still I try to have hope. That ain't right of me. She is happy. You should be happy that she is happy. So any time I wan't to show my love towards something I choose rather not to do it. To hide the love and emotions. This is thetopic that I don't want to talk about, because it can hurt her and that is not something I try to do. So in order to spare her I try to shut down and to not open up, because it's not her job to fix me. She has her own troubles and her own person who deserves the care and energy not me."
    },
    {
        "title": "Fix Sad Reality",
        "author": "SHADOW_XOXO",
        "content": "I’ve never been good with words, I’m not a poetic person; so please excuse the awful imagery that’s going to be used in an effort to convey how I feel. I also remember Sunday May 8th, I made a joke and you shed a tear because that was the first time that day you felt something besides depressed.  When I heard that I panicked and I knew I had to do something, so we went to the movies. Although I suggested we go to the movies to cheer you up I also kind of needed a hug or something to cheer me up. I was hoping you would give me a hug when we met up, but you didn’t -don’t feel bad though- at least I kinda got one when we said goodbye. I'm sorry thats selfish I know. I hate that pain and cold has to be something that you feel is a part of you, and I know it is a hard thing to fix, but I want to try, I have to try.  But I also don’t want to be another person that rips out 200% of your soul and leave you in such immense pain to deal with alone.  That would go against everything I’m trying to do. “If you’re always there for her, she won’t realise what you mean to her” well… that’s not true.  You mean a lot to me, more than you think, more than you give yourself credit for. You keep saying you’re dispensable, but you’re not, you really truly mean a lot to me. “You’re doing most of the work while not having the luxury of being in the relationship” I’m sorry I don’t want you to feel this way I’m trying to make the time and effort you spend worth, but I’m sorry if I have failed to that."
    },
    {
        "title": "Love of my life's birthday",
        "author": "Iwann",
        "content": "To the love of my life, I hope you have the best birthday ever. I wish I was there to celebrate it by your side and spoil you rotten. I know since it's your birthday you are the one who is suppose to make the wish, but I'm going to change it up and tell you my wish for you. My wish for you is for you to look in the mirror and see yourself through my eyes, your elegance and beauty trancends the bounds of this world. You are a true angel, and I am so grateful to have you in my life. You have a pure and kind soul that is a light in a dark and bitter world. Since meeting you for the first time 3 years ago you have never left my mind, you've always had a place in my heart and now after all these years my love for you has fully blossomed like a sakura tree in full bloom. I hope you have the best day ever, and I can't wait to see you again. I love you."
    }
      
]
