{
    "title": "Grand Finale",
    "author": "NuclearBro",
    "content": "Won't lie, I can't remeber what I wrote in the other books. And I don't even care anymore. I'm back to my normal self. No emotions, no feelings. This is just better for everyone. Only wish that I didn't show the people close to me how nice, loving and caring I am when I'm in love. Because now they think there is something wrong when I'm my normal self. Fuckit, it was fun while it lasted but finally I'm begining to wake up. Hurts, but I don't even care anymore. Thought about life last night. I came to the conclusion that if I don't find someone or something to live for before I'm 30. I might just take out life insurance and drive off a cliff or something. The money I will send to my hand full of people I care about. Also reviewed each person that I care about. Realized that some of them don't care about me. They never did, and never will. It was fun being a normal human with emotions and feelings for a while. Not going to lie I really enjoyed it. But I know the world is cruel and unforgiving so in order to save myself I remove my emotions and feelings. Sure I don't hide them when I'm with people I trust. Sure they sometimes hurt me, but at least I know there is a reason for them to hurt me. They actually care. And I'm sorry for them, they had to put up with me. I will make it up to them before I go. Been thinking about side jobs for the future and something that intrigued me was being a test pilot. Now I know the planes that the military test are very safe, so I moght have to go work for a private company. It will pay well, and I get to fly planes. Something I love, and there is risk involved. It just checks all the boxes. I actually am sorry to admit that it took me this long to accept the facts. I knew from the begining it was too good to be true. I had hope I guess. Bad to know how much that can hurt. The only reason I stopped loving is because....... I know she doesn't love me, and I made peace with that, I think..."
}