{
    "title": "Happy Memories",
    "author": "NuclearBro",
    "content": "Memories. Be it happy or sad they are part of us. Personally I have alot of both. Although recently I have been dwelling in the bad memories. Why I did that I don't know. Well I guess I kinda know. Now however I have been focussing on the good ones. Don't know what triggered it. Might have been last nights dream. Now I very rarely dream. Last night's was one of the first one that wasn't a nightmare that woke me, or one I forget in the morning. It was warm and fuzzy, like a happy cloud. It brought me back to some of my favourite memories. Unfortunetly if I had the choice I would have skipped some of those memories. But there aint no point in trying to fix the past. Never thought she would come to mean so much to me. In hindsight I probably should have just never given her the attention she wanted. She did leave me for another guy. Never the less I'm trying to remember the good. All the stupid jokes. The movie experience. Her first sushi attempt. My poor stolen hat. I remeber it like it was yesterday. The stinking smell of the Mooi Rivier Mall sent chills down all of my bones, or maybe it was the stress. She came walking from the complete oposite direction I suspected. Boy did I not feel like an idiot. Never the less John Dorrys was nice and warm. The ocean smells tickled my nose. Sitting oposite her I make it look like I know what I was doing. Nearly hitting the waiter in the face with the menu as I attempt to schetch my story to her. Can't even remeber what it was. Just her sudden burst of histaricle laughter as the poor waitress flee the scene where she was nearly beaten. The sushi danced on my tongue as I sat with a smile, just staring at her. She was busy un-sticking the sushi from the plate. After that we went through the mall. To this day I had no idea what gave me the idea to walk into PNA. Not that that was a bad thing, they have beuatiful gift bags and cards. Hand in hand we strolled down the mall. Laughing at the stupid things we saw. Finally the movie. I think it was justice leauge. I have no idea. Holding her in my arms felt like something straight out of a book or movie. The next day I headed over to her house. Of course I bought her mom some beautiful multi-coloured rosses with a chocolate. I gave her a extremly cute teddy bear.  If it wasn't for her I would have kept it for myself. I thought Flash was fast, but time ran cirles around him that day. Having her in my arms felt.... I don't quite have the word for it, magnificent is probably the closest. It was only after she left that I realized she stole my favourite hat and my favourite jacket. Nothing I can do about it now. It was almost her birthday, I could barely keep my excitement at bay. I bought her a nice set of chopsticks to remind her of our first date. A snow globe with a couple hugging in the snow to remind her of our extreme movie night adventure. It was – 20 degrees outside, well at least it felt like that. We were wrapped up in warm blankets watching a scary movie, nothing quite like that. Followed by some of her favourite chocolates. Lastly a neckless with her favourite animal. A small blue crystal in the dolphin’s eye. Our initials etched into the metal, surrounded by a heart. Little did I know what would happen that weekend. Her dad came to visit her. Me and him got along extremely well. Little did any of us know what would happen that Sunday night. Actually, that’s a lie. I knew something bad was going to happen. Being in love. There is nothing quite like that. Having that one person whose arms feel like home. Their caring eyes to assure you that everything will be alright. Your person who knows all of your dirty little secretes and deepest insecurities. That one person who stops the world from spinning as you gaze into their eyes. Taking you to another dimension as you softly kiss them. All of your problems just magically melt away. The first thing I do when I fall in love is, I unknowingly stare at that person in awe. This I only recently found out. Is there someone special who makes me do this? Maybe, maybe not."
}