{
    "title": "Memories",
    "author": "NuclearBro",
    "content": "Why do I keep comming back to this place? This place has so many memories. I know jurnaling is the only way to realy open up. There is no need to bother someone with my thoughts if I can just write them down. Always had a stupid exuse as to why I don't jurnal in a word doc. Reality is that when i write a book there is a small chance that sameone will read it. Using a word doc means no one would ever look at it. The reason for always coming back here when i write is that i have so many happy memories here. Truth is that those happy memories can also be the saddest memories. For me to write about myself i have to be sad, so it only logically makes sense to come to the place where you can be at your happiest or your worst. I know how repetitive it is to constantly write about the same topic. Unfortunatly i don't want to write about topics that i have no info about. That's why i write about my feelings, sure it opens up wounds, but what is life without a little pain. Pain reminds us of the journey that we have traveled to get to where we are today. Sure it also reminds you of all the mistakes you have made. But nothing ventured, nothing gained. Didn't think i would ever continue to write this book. Seeing as i'm here now i might as well just finish it. In order not to write something that i have written before i have decided to do a tour of this world and talk about some of the special builds and the reasons behind them. First item on the docket was my poorly executed graveyard. i built it to display my broken heart. Fuck that sounds cliche. Anyway, a graveyard surrounded by lava and fire, not only was it meant to add atmosphere to the build it was to show the scars and bruises left behind from previous relationships. The feelings being burried needs no explanation. I was in love with someone so above my leuge you wouldn't even believe. But hey that's all in the past now. Then there is my boat in a bottle. It pays tribute to Livingston's song called message in a bottle. i built it with this song in mind, because in the song Livingston says that he writes a message in a bottle that he hopes his lover never finds, because it holds all his love for her. Later on i had the boat errupt into fire to show my love burning away. In it's place i made a new boat, where the boat first was full of hapiness the second was filled with regrets and realisation that dreams rarely come true. The bottle contained books expressing my feelings, something i don't normally do. That is why i went with the bottle, i hoped no one would ever find it. Next on the list is my terrible pink floating words. Wrote them for someone i deeply care about. The reason i didn't simply write them in a book was because i felt she deserves more than just a few scribbles in a book. In essens it was in a attempt to place emphasise on the statement. Wanted to give it a cool shadow effect with stained glass, but time was not on my side, and i admit it was a bit of a rush job. Never the less i mean every last word of it. The last significant built was my enchanted golden apple. i constructed it after i got a a similar message on a regular enchanted golden apple. Instead of just giving back a normal sized apple i wanted to show that whatever she gave me, ten times more is what i would give back, because she truely deserves it. She is one of the few people in this world who desevers so much more. In hindsight there are some things i would have changed, but it's too late now. Those were simpler times, is all that's going through my mind at the moment. Truth be told those were also some confusing times. Trying to figure out where i stood with this special someone left me with alot to think about. In the begining nothing mattered to me. I didn't give a dam about my classes, all i knew was that i fell hard for someone and no matter what i did i just couldn't shake her from my mind, not that i wanted to get her off my mind. She was a light at the end of a very long and dark tunnel that i had been in. As time progressed i started to gain more control over my thoughts, forcing myself to start focusing on facts rather than dreams. I was at war with myself. My heart wanted to go this way, but my head knew of better. It was a tug of war and didn't know which side i wanted to win. Having my heart win meant that i might get it broken again. -It's kinda funny, even if i get my heart broken i continue to love the person that broke it with all the little pieces.-On the other hand if my mind won i might miss the opportunity of a life time. And there would be no forgiving myself for that. In the end i guess my mind won. i had forced my feelings deep down as a defense mechanism. Even tho all is said and done i still catch myself thinking of her, just hoping she's happy. And i still can't stop myself from shivering or getting goosebumps everytime i get to hear her breathtaking voice. My mind turns into a racetrack, all my thoughts speeding around. My heart turns into a jackhammer. Beating out of control. i have never felt this way about someone before. Like i said in the begining this is my message in a bottle. i don't often tell people about the things i have written in the books, but little by little i found myself opening up to someone, someone who means the absolute world to me. Thank you for being my world."
}