{
    "title": "Message in a Bottle",
    "author": "NuclearBro",
    "content": "Keep fighting. You don't stand a single chance to win unless you fight. Eren Jaeger, Attack on titan. Every day every single one of us is fighting, be it to get a promotion or just to make it through the day. Why do we keep on doing it? Is it simply because we don't know? What else to do? Get knocked down you have to get up, but how many times can one get back up. I guess it depends on the importance of the fight. If it's important enough, you most likely will get back up every time. But how do you determine if the thing you’re fighting for is even worth it? I suppose that's what experience is for. Unfortunately, this doesn't always work out. If you get knocked down too much before you find something or someone worth fighting for you will give up. You will stop fighting to spare yourself some pain, regret, and disappointment. You lose yourself and having to find yourself after being lost for too long can prove to be impossible. It's like losing yourself to the void. An empty abyss. Some people find something or someone to cling to get out of such a dark bottomless pit. I don't know if that's better or worse. On one end you can try to find yourself. On the other, the fight cycle starts again.Hope, is one of the biggest deceivers. Having hope is great in some cases, but more often than not it hurts and disappoints people. I would know. Some people had hope for me, how disappointed they were. Why did they have hope for me?Surely, they must have seen I'm a lost cause. My only goal on this earth is to help other people. I don't give a damn about my problems. Sure, being beaten up, verbally abused, insulted, humiliated, manipulated, and just made the bad guy in every story hurts. I just choose to ignore the pain. I try to ensure that no one other being has to go through so much pain. I'm not saying I'm unique, or better than anyone. There are many stories far worse than my own. I’m trying to say that I know how most things feel. That’s why I try and help. No matter how many bad memories it brings up.  Fuck, saying that makes me sound like a good person. That's not true. The things I did. I honestly should have just rolled over and died. I remember every time I got beaten up the guy would ask You give up yet shitface? My answers were always the same. Never asshole Sure I got beaten even more, but it was worth it. Thinking about it I'm glad I went through all the events that I went through. It keeps me grounded. Of course, nobody knows this, and I don't think anybody will ever know. I just keep this to myself. It's my burden to bear. Maybe one day I will tell someone. The problem is that the times that I have opened up to people they turn into strangers with some of my secrets. That is entirely my fault. I forget that I'm only here to help other people. Or at least to try. It was all going well, until recently. I was only supposed to help her and try to fix her problems, but before I knew it she knew most of mine. She made it her job to try and fix my problems, even though she has her own to fix. Even worse is that she has her own special persons problems to try and fix. Now I’m just taking up her time and energy with my stupid problems. That ain’t right of me. I’ve never found myself in a situation quite like this one. So I have no idea what to do. I concluded that comforting her that everything will be ok is the best path forward. Never speak a word of doubt about her person. Just always put him in a positive light. No matter the personal cost. Though this choice has side effects too. If he does something to make her overstep her boundaries I have two options. Both starting with being a shoulder for her to cry on. Then I can either assure her that it won’t happen again, or I tell her the ugly truth to spare her from another similar experience. I told Zellie the bare minimum to just get her opinion about the situation. She thinks that I have to tell her the ugly truth right now, in order to try and spare her. But then again Zellie doesn’t have all the facts. It isn’t my place to say anything so I won’t ever tell anyone everything. She also told me she misses the good old days. Me and her. She reminded me of everything. Us going to the movies and feeling as awkward as can be. All of our little adventures. Picnic under the stars, blankets wrapped tightly around us to keep out the cold. The gigantic red bear with the words “I love you” written on a heart which was locked in its paws. Going for walks and just talking about the most idiotic things. We had no secrets. It was the agreement we made the day I asked her out. I could lay myself bare to her. She knew everything about me, all my inner workings, just as I knew hers. Having her by my side I felt like I could do anything. No mountain too big to climb. No ocean too rough to tip my little boat. Every time I think of her the same memory comes back. Standing on top of the wagon filled with corn I glanced at her. Her face was a ray of sunshine. Her golden blond hair danced in the light breeze. A smile that could melt any cold heart. I remember thinking “how on earth did I manage to get the most beautiful girl in the entire school?” When she moved away I was a mess. I’ve never been quite able to open up to someone since then. Maybe because I think that I have to be in a relationship to have the ability to open up. Now I find myself between a rock and a hard place. As much as I want to open up to this amazing girl I hurt her when I do. If I don’t open up I also hurt her. And I’m so sorry about that. I hate hurting people. I would rather hurt myself than the people I care about. I never wanted it to be like this. But in the end, it’s my fault, and mine alone. I knew I ran the risk of falling in love, but my desire to help her and care for her got the better of me. Now because of my idiocy, she is in a difficult situation. And I hate myself for that. I want to help her, but I can’t. She wants help from her special person. And that ain’t me. As much as it hurts to admit it’s the reality. And I need to start facing it. I had the opportunity to be happy, I blew it. Now I’m ruining someone else’s opportunity to be happy. I should be happy for her. Her special person is superior to me in every single way. He has the looks and the skills and he walks the walk. I’m but merely a simple man with simple needs. I should have just never had hope for myself. Hope is a dangerous weapon. I guess I thought that because I did the impossible once I could do it again. Little did I know the games changed. So, as I said I am but merely a friend. Someone who listens and tries to help. I should be thankful that I’m even able to be a small part of her life. She said she is torn in half. Can’t lie I find that hard to believe. Like I said he is superior to me in every way. Other than that I’ve done nothing to deserve her care. I’ve broken all my promises to her. Now my goal is to just be the fat funny friend."
}