{
    "title": "Sad Reality",
    "author": "NuclearBro",
    "content": "I remeber it as if it was yesterday. Sunday May 8th was a cold and rainy winter night. I was driving with a milion thoughts racing through my mind. The conversation with my mother was still fresh in my mind. Her words, like footsteps in the sand, now embedded in my mind. Does she really think I'm going to get hurt again. She was right the first time. Just the thought about my ex nearly made my entire body shut down. The pain was unlike most things I've felt before. Pain is not something that I despise, I'ts part of me. That perhaps is my biggest flaw. When I care about someone I give them 200% of myself. This works out great until you wake up one day and realise you will do everything for that person, but they won't even do the littles thing for you. Everytime this happends 200% of my soul gets ripped from my body and that pain is something I can't bear. That's why I build walls and never open up to anyone. But this one person came into my life. The only person ever who was able to knock down some of the walls. She is really one of a kind.The problem that I face is having opened up to her I am vulnerable to that imence pain. This I only realized late that night. My mothers words flashed through my head again If you're always there for her, she won't realise what you mean to her. That can't be true,  could it? Just thinking about sacrificing any time that I get to spend with her makes me sick to my stomach. Because I know this won't last forever. And I want to cherise every moment I spend with her. I know who I am, and thats a fact that I made peace with long ago. She thinks I like the cold feeling inside, but thats not true. I love being warm and fuzzy, it's just that I don't get that feeling so I made myself use to the cold lonely feeling. I think it might be because I'm afraid of getting hurt again. Picking myself up again and moving on is something I'm dead something I'm dead afraid of.  So my coping mechanism is to just force myself to lose all the feelings. Sure that turns me into a shell of a human, but as long as I know the other person is ok I have to be ok. Depressing I know, but what can I do but try and move on.Like I said before pain is part of me, a rather hard thing to fix. Asof the time of writing this I have'nt stoped shaking once. The tears are flowing, just like last night. Only difference is that I did'nt notice them last night as the rain slammed into my face. Now unfortunetly they're unavoidable. I guess what I'm trying to say is that the future terrifies me. I want her to be happy, but I know I can't do that. I'm incapable of giving her what she needs and wants. Thats the story of my live. Find someone, try to help them, fall in love, see them loving someone else, try to move on. Depressing I know, but what can I do but try and move on. You're doing most of the work while not having the luxury of being in the relationship"
}