{
    "title": "Support 101",
    "author": "NuclearBro",
    "content": "Won't lie, I've been laying awake for at least 3 hours now, thinking. Why her? Why on earth does she need to go through this shit show. It absolutely breaks me to see how much she is willing to help others, but not one of them try to help her. Why does she have to go through this pain. Clasifying it as a rough childhood is a bit of a understatement. Be that as it may, it transformed her into one of the strongest most capable woman I know. And don't forget her jaw dropping beauty. She is nothing short of a 10. There is no one in the entire universe like her. All of us should be ashamed of our rude behavior towards her. She never deserved any of it. And it is in no small part thanks to us that we made her feel bad about herself. There is no one, I kid you not, not one, the reason for her to have any doubts about herself. All of us should be ashamed of our rude behavior towards her. She never deserved any of it. And it is in no small part thanks to us that we made her feel bad about herself. There is no one, I kid you not, not one, the reason for her to have any doubts about herself. That is so wrong. But then again we only cared about ourselves. Only now do I realize how deep the wounds are. Fixing it is not going to be an easy job. But like I told her I’m here with her till the end. No matter what happens, no matter who tries to stand in her way. I will never leave her. Not that she needs me. She is so much stronger than she realizes. Being through everything she has been through and then still standing tall amongst us, that is an otherworldly strength. No one I know would be able to do that. It pains me to see how she is worth so much more than all of us, but she is still bound by our horrible past actions. Honestly, I despise us so much for doing that to this literal angel. Had I known back then what I know now, I would have pushed a couple of people off of a cliff. Nevertheless, I can’t change the past. So I will do everything I have to, to give her back the things we took from her. Because she deserved so much better than us."
}