{
    "title": "This Is The End",
    "author": "NuclearBro",
    "content": "Thought this would be a book about things getting better, road to recovery. Thinking about it now, it isn't. This one is going to hurt. I know there is going to be a piece of my heart in this book. I have been putting it of, because I had hope. Finally I realized that it means nothing. Normally I ain't an emotional person, but I'm fighting to hold back the tears. There it goes. One single tear. Sliding gently over my cheek. Blurry vision, heart feels as if it's going to fall out of my chest. Dam I feel alone at the thought of what I'm about to say. Has been quite a while since I hurted this bad. But hey, nobody fucking cares. Not that I want anybody to care. Anyway, the point I wanted to make was that it doesn't hurt anymore. Hearing about him has no more effect on me. There is no more pain, not when I hear about how great he is. Not when she leaves for him. Never said anything, and I never will. It's so selfish of me to try and keep her for myself. I should throw myself of a bridge. What I did was/is so wrong in so many ways. Time for my brain to take the reins. My heart had a good run, but it's over now. The fun is over. Said in another book that it's time to face the facts. Never did face them, why? I'll tell you why. I had hope. What a dangerous dagger that is indeed. Been working myself to death just to keep my mind away from the good memories. Remebering those gives me hope. And every time I realize the memories were just to make me feel better, it kills me. Why did I ever have hope. Man I'm so stupid. I knew I was going to get hurt. Time to follow Zellie's advice. Support her, just as a friend. Why did I ever even think that it could have been more than that. Wow, it hurts admiting it. She had a really interesting dream, people with lights in the place of a heart. I really loved that idea. Hearing how she got hurt in the dream hurts me so much, I don't want her to get hurt. Ironic isn't it? Said I don't like seeing her get hurt then I do the exact same. Back to the point. She said I would be a green light. Maybe I would, but my little light would fade away. I would be sent to go be with the rejects. We would all just be looking in awe to everyone else. Everyone with their little lights going their own seperate ways. All while we wish we could only be like the others. And suddenly it feels like reality. I just look at everyone with their little lights. Every time I see someone who's light is fading I try and help. Knowing it may end up costing the destruction of my own little light. I have had my light broken. Usually I just pick up the pieces, and the try to help someone with my second hand heart. Some times some people come along that actually care about me, but mostly as soon as you fix someone you dissapear from their lives, until their light starts fading again. Oh well, like she said some people are meant to go through life alone. Only now does that actually sink in. Dam, don't I wish that I was worthy of being with someone. I am willing to sacrafice almost anything just to have someone. When I find someone I put my life on hold for them. They litterally mean the world to me. I do everything to ensure they are happy and ok. At the end of the day I was just jumping through hoops for someone who never cared. Someone who never thought of me as more than just a silly little pet. Maybe the best thing to do is just to stop trying to find someone. I would spare myself the pain. Then again I miss out on the good part. Anyway, I now know for sure that I'm barking up the wrong tree. NF was correct. If you want love you're gonna have to go through the pain. Well no need to try to get her to like me. I'm giving up. I have accepted the facts. Had the idea of creating a real life scavanger hunt for her. It would be around the entire town. All of it would have been minecraft themed. Golden apples with messages, papers with clues and maps with locations of the next item. I would have hired someone to drive her around. Personally I thought it was a great idea. The day would have ended with her having alot of tiny gifts, little notes and jokes, and of course there would be a big present waiting at the end. Oh well, was but wishfull thinking. I will pass the idea on to Charl. He can get the credit for it, and make her happy. As well as getting her to fall more in love with him. Win win situation. "
}