{
    "title": "Thoughts",
    "author": "NuclearBro",
    "content": "No reason for writing this book. Guess it's just to get rid of the thoughts. Don't really have another way of dealing with them lately. Thought that after I forgot all the good times the pain would stop. Problem is I can't seem to get those memories out of my head. Everyday is the same. Wake up, work through the day, get home, exercise, shower and the go to bed. That's when the trouble start. The memories come rushing back. And I wish I could just remove them from my mind. Not because I don't want to remeber them, but the pain they bring with is something else. Thoughts racing around in my head, what could have been, what has been and what will be. Apart from trying to fall asleep I also have to deal with constantly waking up in a cold sweat with my heart beating out of my chest. Nightmares, at least that's what I think. Best way to deal with them is to get up, put my head under the tap and just let the water wash away all of the horror. Apart from the sleeping issue I've managed to move on. To suppres the emotions. To hide the truth, not just to others but to myself as well. That was until today. Got sent an instagram post by one of my friends. And like a flood gate opening up the memories came rushing back. The mix of emotions and memories messed with my head. For a brief periode I found myself in the clouds again. Not having but 1 care in the world. Waking up to reality sucked. Wish I could go for a ride tonight, but I know that the chances of me returning are slim. Don't really know what I have to live for, but I know somewhere someone would need me. So second best thing is to put my headphones on and play music until my ears start to bleed. I'm not expecting anyone to read this, It's nothing special. Just some of my thoughts. Heard a quote the other day that got to me. It said that you don't show emotion, because you want to be seen as strong, but at the same time you hate that no one notices how broken you are. That quote however raises the question. How broken do you have to be before you allow someone to see the true you. For me atleast, I have to be at bedrock. I have to be broken down to the bone. And for me to even consider letting someone in I have to trust them. Trust them with my life. Still look what that has gotten me. The voices in my head are constantly at war. Screaming at each other. All of them wanting to come out. But my lips are sealed. I don't let them demons out, there's no need. I cause enough damage with them locked up. Heaven only knows what would happen if one day I fail to keep them inside. That is the day that I truely destroy myself and the people around me. I'm guessing the only thing these days that keep them under lock and key is my fear for the damage that I might cause to others around me. Even though things are on the ropes for me I'm at least happy to hear that things are going well for some of the people I care about. Like my uncle always say, no news is good news. There was a time when I just wanted to be around people to ensure they are ok. Now that I'm thinking about it I realise people only seem to want me around when things are not going well. Why? Because I listen, I don't judge, I don't care what time they need me. In essence I'm like a 911 operator. I work 24/7 I am willing to do almost anything to help. People are always shocked when they find out how many people I know that specialize in different professions. Reason being that in case someone should need something that might be hard for them to get, I could get with ease. Again the question, why? I'll tell you why. It's so that I can feel like I mean something. I feel like I'm helping. In reality though I did nothing. But as long as it keeps my demons at bay I will continue to believe that I'm helping. Spoke to one of my friends the other day, got to the topic of drinking. He asked me why I don't get drunk. Seeing as being drunk helps with pain and forgetting things. My answer was the same as it has always been. That was until I layed in my bed that night and thought about it. I don't fear the headaches the next morning, I fear that my dumb ass would carry out one of my stupid/ wreckless plans. Fortunetly for me I don't have to drink to feel drunk. Because of my fucked sleeping schedule and my stupid brain not properly sleeping I can barely keep my balance. Just sitting here in bed is proving to be a challenge. My head would just feel as if it's falling to one side and my body just follows it. Like a hobo chasing his runaway trolley. Yay jokes, that's how I dealing with things that trouble me. Turn them into jokes. Makes the people around you laugh which forces you to laugh with, removing the negative from the entire situation. What people don't know is that behind closed doors all of these problems still persists. And some days the just get to much, and then there is no stopping that tear from rolling over yor cheek. Without warning your heart turns to lead. You feel it hit the bottom. Your stomach cruples in a symphony orchestrated by a sore heart. The butterflies that once where just turn into stone. Your face becomes a runway for all the departing tears. Your whole body shaking as if there is a earthquake. There is no stopping it. Your mind races through all the memories and thoughts. The more you think the harder it gets to pull yourself together. The harder it gets to mend your broken world. Eventually the storm passes. You start to pick up the pieces and try to put the pieces back together again. But like a puzzel spilled onto the floor you don't always find all the pieces. Sometimes you loose a little of yourself. Either way you know you can't let anybody see it. That is until you found that one person. That one person that makes the earth stop spinning. That person who's eyes you get lost in. That someone who's smile is enough to pull you through the darkest of times. The one you would walk to the end of the earth for. They are the one with whom you can be open. The one you can tell about all your fears. The one in who's arms you feel safe. The one whose mear presence makes it feel as if your in the clouds. When your with them your untouchable. Not even the devil can scare you when they are by your side. But one of the most fucked up things is when that person that filled the empty void inside of you just fades away. That can break anyone. No matter what you've been through that is one of the most painfull experiences to ever exist."
}