{
    "title": "Vaca",
    "author": "NuclearBro",
    "content": "I don't fully know what is bothering, nor do I know how to help. My working theory is that she is hurt by the fact that he doesn't want to send her <3 anymore. Don't know why he is this way, esepecialy now. He s less than a week from seeing her, meeting her in person. Boy there is nothing  nearly as amazing as getting to meet her. Him coming to visit might also be something that stresses her out. In my opinion there is nothing to worry about. He won't try anything. Then again apparently I never knew him. Is a funny story. He says that I overshare. Funny enough I clearly remeber him telling me that he doesn't know why people tell him their secrets, because he doesn't intend to keep them a secret. Oh well, back to the point. Maybe he just stopped sending her <3 because he had a bad week. Shit reason to stop sending the person you love <3, but I don't know what the situation is like. I'm sure he still loves just as much as the day he first got to know her. I mean what's there not to love. She has a blessing smile, she's quick on her feet, she's so caring and loving, she's extremely observing. And lets not forget her excuisite beauty. From head to toe she is nothing but a 10. Silky smooth dark hair. Deep brown eyes. Her nails might be intimidating at first, but they just add to her breathtaking beauty. Heaven only knows how this stunning girl has not won a award for her beautiful looks. She asked me why she did to deserve such a harsh life. Been chewing on that bone for a while, still can't figure it out. My best guess is that life tends to push people to their breaking points. And only the strongest survive. She is one of those extremly tough people Personally I would have cracked under the extreme preasure she is under. Thankfully it's vaca now, and I believe things will start looking up. He will treat her with the respect she deserves. She will feel safe in his arms. As she likes to describe it, it will feel like home. His gentle kisses will remind her of how much he truely loves her. Reasuring her of her true beauty, both inside and outside."
}