{
    "title": "Worst Idea Yet",
    "author": "NuclearBro",
    "content": "Opening up. The idea itself freightens me to my core. I've always been the therapist, never having to open up to anybody. This was due to the fact that I always act fine. Never let anyone know how I truely feel inside. Don't get me wrong I love to help other people, and I don't think I will stop.Now that I think about it I've opened up way past the point that I wanted to. And that fact scares me. There is one topic that terrifies me more than anything else. Trying to avoid it doesn't work. This is something that I have to get off my chest. I'm trying to get myself to move on, to bury the feels. For the most part I feel that I'm doing an ok job. Actually I think I might have finally accepted it. Yes it still hurts to hear how perfect he is, but I can't say that because that will make her stop talking about him to spare me. That doesn't sit right by me. How can I try and help someone if I don't have all the info. Puting myself before him like this is not something I'm willing to do. He is her everything, and as long as she is happy I am happy. My only goal in life is to make sure everyone's happy, myself excluded. Then there is my loving side. Of that I haven't showed her much. The only reason for that is that I can't show that side. If I show that side of me I won't be able to hide my true feelings. Why I punnish myself by thinking that I had a chance to make her happy I don't know. I have all the facts, I have every bit of effidence to convince myself other wise. Still I try to have hope. That ain't right of me. She is happy. You should be happy that she is happy. So any time I wan't to show my love towards something I choose rather not to do it. To hide the love and emotions. This is thetopic that I don't want to talk about, because it can hurt her and that is not something I try to do. So in order to spare her I try to shut down and to not open up, because it's not her job to fix me. She has her own troubles and her own person who deserves the care and energy not me."
}